### 📖 Terraform Plan (src/common/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.application_gateway_itn.azurerm_web_application_firewall_policy.agw will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "agw" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-itn-agw-waf-01"
        name                = "io-p-itn-agw-waf-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.application_gateway_itn.azurerm_web_application_firewall_policy.app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-itn-agw-api-app-waf-01"
        name                = "io-p-itn-agw-api-app-waf-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_custom_domain.logos_custom_domain will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "logos_custom_domain" {
      + cdn_frontdoor_profile_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assets-cdn-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-assets-afd-01"
      + dns_zone_id              = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/dnsZones/io.pagopa.it"
      + expiration_date          = (known after apply)
      + host_name                = "assets.logos.io.pagopa.it"
      + id                       = (known after apply)
      + name                     = "io-p-itn-assets-logos-domain"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_endpoint.logos_endpoint will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "logos_endpoint" {
      + cdn_frontdoor_profile_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assets-cdn-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-assets-afd-01"
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "io-p-itn-assets-fde-02"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_origin.logos_origin will be created
  + resource "azurerm_cdn_frontdoor_origin" "logos_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = false
      + enabled                        = true
      + host_name                      = "iopstcdnassets.blob.core.windows.net"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "iopstcdnassets"
      + origin_host_header             = "iopstcdnassets.blob.core.windows.net"
      + priority                       = 1
      + weight                         = 1000
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_origin_group.logos_origin_group will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "logos_origin_group" {
      + cdn_frontdoor_profile_id                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assets-cdn-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-assets-afd-01"
      + id                                                        = (known after apply)
      + name                                                      = "io-p-itn-assets-fdog-02"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + health_probe {
          + interval_in_seconds = 100
          + path                = "/"
          + protocol            = "Https"
          + request_type        = "HEAD"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.logos_route will be created
  + resource "azurerm_cdn_frontdoor_route" "logos_route" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "io-p-itn-assets-cdnr-02"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]

      + cache {
          + compression_enabled           = false
          + query_string_caching_behavior = "IgnoreQueryString"
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule.logos_global_cache will be created
  + resource "azurerm_cdn_frontdoor_rule" "logos_global_cache" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "globalCache"
      + order                       = 1

      + actions {
          + route_configuration_override_action {
              + cache_behavior                = "OverrideAlways"
              + cache_duration                = "08:00:00"
              + query_string_caching_behavior = "IgnoreQueryString"
            }
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule.redirect_rules["organization_logos"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "redirect_rules" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assets-cdn-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-assets-afd-01/ruleSets/ruleset"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "organizationlogosRewrite"
      + order                       = 3

      + actions {
          + url_redirect_action {
              + destination_hostname = "assets.logos.io.pagopa.it"
              + destination_path     = "/services/{url_path:seg2}"
              + redirect_protocol    = "Https"
              + redirect_type        = "Moved"
            }
        }

      + conditions {
          + url_path_condition {
              + match_values     = [
                  + "/logos/organizations/",
                ]
              + negate_condition = false
              + operator         = "BeginsWith"
            }
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule.redirect_rules["service_logos"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "redirect_rules" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assets-cdn-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-assets-afd-01/ruleSets/ruleset"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "serviceslogosRewrite"
      + order                       = 4

      + actions {
          + url_redirect_action {
              + destination_hostname = "assets.logos.io.pagopa.it"
              + destination_path     = "/services/{url_path:seg2}"
              + redirect_protocol    = "Https"
              + redirect_type        = "Moved"
            }
        }

      + conditions {
          + url_path_condition {
              + match_values     = [
                  + "/logos/services/",
                ]
              + negate_condition = false
              + operator         = "BeginsWith"
            }
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule.redirect_rules["services_webview"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "redirect_rules" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assets-cdn-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-assets-afd-01/ruleSets/ruleset"
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "serviceswebviewRewrite"
      + order                       = 5

      + actions {
          + url_redirect_action {
              + destination_hostname = "assets.logos.io.pagopa.it"
              + destination_path     = "/services/{url_path}"
              + redirect_protocol    = "Https"
              + redirect_type        = "Moved"
            }
        }

      + conditions {
          + url_path_condition {
              + match_values     = [
                  + "/services-webview/",
                ]
              + negate_condition = false
              + operator         = "BeginsWith"
            }
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule.rewrite_rules["organization_logos"] will be destroyed
  # (because azurerm_cdn_frontdoor_rule.rewrite_rules is not in configuration)
  - resource "azurerm_cdn_frontdoor_rule" "rewrite_rules" {
      - behavior_on_match           = "Continue" -> null
      - cdn_frontdoor_rule_set_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assets-cdn-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-assets-afd-01/ruleSets/ruleset" -> null
      - cdn_frontdoor_rule_set_name = "ruleset" -> null
      - id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assets-cdn-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-assets-afd-01/ruleSets/ruleset/rules/organizationlogosRewrite" -> null
      - name                        = "organizationlogosRewrite" -> null
      - order                       = 3 -> null

      - actions {
          - url_redirect_action {
              - destination_hostname = "iopstcdnassets.blob.core.windows.net" -> null
              - destination_path     = "/services/{url_path:seg2}" -> null
              - redirect_protocol    = "Https" -> null
              - redirect_type        = "Moved" -> null
                # (2 unchanged attributes hidden)
            }
        }

      - conditions {
          - url_path_condition {
              - match_values     = [
                  - "/logos/organizations/",
                ] -> null
              - negate_condition = false -> null
              - operator         = "BeginsWith" -> null
              - transforms       = [] -> null
            }
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule.rewrite_rules["service_logos"] will be destroyed
  # (because azurerm_cdn_frontdoor_rule.rewrite_rules is not in configuration)
  - resource "azurerm_cdn_frontdoor_rule" "rewrite_rules" {
      - behavior_on_match           = "Continue" -> null
      - cdn_frontdoor_rule_set_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assets-cdn-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-assets-afd-01/ruleSets/ruleset" -> null
      - cdn_frontdoor_rule_set_name = "ruleset" -> null
      - id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assets-cdn-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-assets-afd-01/ruleSets/ruleset/rules/serviceslogosRewrite" -> null
      - name                        = "serviceslogosRewrite" -> null
      - order                       = 4 -> null

      - actions {
          - url_redirect_action {
              - destination_hostname = "iopstcdnassets.blob.core.windows.net" -> null
              - destination_path     = "/services/{url_path:seg2}" -> null
              - redirect_protocol    = "Https" -> null
              - redirect_type        = "Moved" -> null
                # (2 unchanged attributes hidden)
            }
        }

      - conditions {
          - url_path_condition {
              - match_values     = [
                  - "/logos/services/",
                ] -> null
              - negate_condition = false -> null
              - operator         = "BeginsWith" -> null
              - transforms       = [] -> null
            }
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule.rewrite_rules["services_webview"] will be destroyed
  # (because azurerm_cdn_frontdoor_rule.rewrite_rules is not in configuration)
  - resource "azurerm_cdn_frontdoor_rule" "rewrite_rules" {
      - behavior_on_match           = "Continue" -> null
      - cdn_frontdoor_rule_set_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assets-cdn-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-assets-afd-01/ruleSets/ruleset" -> null
      - cdn_frontdoor_rule_set_name = "ruleset" -> null
      - id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assets-cdn-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-assets-afd-01/ruleSets/ruleset/rules/serviceswebviewRewrite" -> null
      - name                        = "serviceswebviewRewrite" -> null
      - order                       = 5 -> null

      - actions {
          - url_redirect_action {
              - destination_hostname = "iopstcdnassets.blob.core.windows.net" -> null
              - destination_path     = "/services/{url_path}" -> null
              - redirect_protocol    = "Https" -> null
              - redirect_type        = "Moved" -> null
                # (2 unchanged attributes hidden)
            }
        }

      - conditions {
          - url_path_condition {
              - match_values     = [
                  - "/services-webview/",
                ] -> null
              - negate_condition = false -> null
              - operator         = "BeginsWith" -> null
              - transforms       = [] -> null
            }
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule_set.logos_ruleset will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "logos_ruleset" {
      + cdn_frontdoor_profile_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assets-cdn-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-assets-afd-01"
      + id                       = (known after apply)
      + name                     = "logosruleset"
    }

  # module.function_app_admin.module.user_data_backups_storage_account.azurerm_monitor_diagnostic_setting.blob_service[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "blob_service" {
        id                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-platform-admin-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnuserbackupsst01/blobServices/default|iopitnuserbackupsst01-blob-diagnostics"
        name                           = "iopitnuserbackupsst01-blob-diagnostics"
        # (5 unchanged attributes hidden)

      - enabled_metric {
          - category = "Capacity" -> null
        }
      - enabled_metric {
          - category = "Transaction" -> null
        }
      + enabled_metric {
          + category = "AllMetrics"
        }

        # (5 unchanged blocks hidden)
    }

  # module.function_app_admin.module.user_data_backups_storage_account.azurerm_monitor_diagnostic_setting.queue_service[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "queue_service" {
        id                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-platform-admin-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnuserbackupsst01/queueServices/default|iopitnuserbackupsst01-queue-diagnostics"
        name                           = "iopitnuserbackupsst01-queue-diagnostics"
        # (5 unchanged attributes hidden)

      - enabled_metric {
          - category = "Capacity" -> null
        }
      - enabled_metric {
          - category = "Transaction" -> null
        }
      + enabled_metric {
          + category = "AllMetrics"
        }

        # (5 unchanged blocks hidden)
    }

  # module.function_app_admin.module.user_data_backups_storage_account.azurerm_monitor_diagnostic_setting.storage_account[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storage_account" {
        id                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-platform-admin-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnuserbackupsst01|iopitnuserbackupsst01-diagnostics"
        name                           = "iopitnuserbackupsst01-diagnostics"
        # (5 unchanged attributes hidden)

      - enabled_metric {
          - category = "Capacity" -> null
        }
      - enabled_metric {
          - category = "Transaction" -> null
        }
      + enabled_metric {
          + category = "AllMetrics"
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_app_elt.module.function_elt_itn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"             = (sensitive value)
            # (75 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-elt-rg-01/providers/Microsoft.Web/sites/io-p-itn-elt-func-01"
        name                                           = "io-p-itn-elt-func-01"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Platform"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "5.0.1"
            "Source"                                 = "https://github.com/pagopa/io-infra/blob/main/src/domains/elt/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.function_app_elt.module.function_elt_itn.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                                                = (sensitive value)
            # (84 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-elt-rg-01/providers/Microsoft.Web/sites/io-p-itn-elt-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Platform"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "5.0.1"
            "Source"                                 = "https://github.com/pagopa/io-infra/blob/main/src/domains/elt/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_app_services_02.module.function_services.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "[REDACTED]"
            # (61 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-platform-services-rg-02/providers/Microsoft.Web/sites/io-p-itn-services-func-02"
        name                                           = "io-p-itn-services-func-02"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Platform"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "5.0.1"
            "Source"                                 = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.function_app_services_02.module.function_services.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "[REDACTED]"
            # (62 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-platform-services-rg-02/providers/Microsoft.Web/sites/io-p-itn-services-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Platform"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "5.0.1"
            "Source"                                 = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
        name                          = "io-p-itn-platform-api-gateway-apim-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "2.2.3"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

      ~ hostname_configuration {
          ~ proxy {
              ~ default_ssl_binding             = true -> false
                # (12 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.data.azurerm_private_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-evt-rg"
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_private_endpoint.service_bus_pep[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "service_bus_pep" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01"
        name                          = "io-p-itn-platform-sbns-pep-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_service_bus_namespace"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.1.0"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 10 to add, 12 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.application_gateway_itn.azurerm_application_gateway.this,
  on ../_modules/app_gateway/main.tf line 5, in resource "azurerm_application_gateway" "this":
   5: resource "azurerm_application_gateway" "this" {

the `ssl_profile.verify_client_cert_issuer_dn` property has been deprecated
in favour of the `ssl_profile.verify_client_certificate_issuer_dn` property
and will be removed in v5.0 of the AzureRM provider

(and 27 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/assets_locales_cdn.cdn_storage/cmk.tf line 18, in resource "azurerm_key_vault_access_policy" "keys":
  18:   for_each     = (local.cmk_flags.kv && try(local.cmk_info.kv.same_subscription, false) && try(data.azurerm_key_vault.this["kv"].enable_rbac_authorization, false) == false ? toset(["kv"]) : toset([]))

The attribute "enable_rbac_authorization" is deprecated. Refer to the
provider documentation for details.

(and 3 more similar warnings elsewhere)
```

</details>
